// case 18001:
//       msg = '无效的私钥';
//       break;
//     case 18002:
//       msg = '钱包密码错误';
//       break;
//     case 18003:
//       msg = '根据私钥产生钱包地址出错';
//       break;
//     case 18004:
//       msg = 'keystore文件格式错误';
//       break;
//     case 18005:
//       msg = '无效助记词';
//       break;
//     case 18006:
//       msg = '根据私钥生成keystore文件时出错';
//       break;
//     case 18007:
//       msg = '钱包地址已经存在';
//       break;
//     case 18008:
//       msg = '钱包id对应的记录不存在，请确认钱包id的值';
//       break;
//     case 12005:
//       msg = '跨链合约abi检查错误';
//       break;

export const msgConstant = {
  18001: '无效的私钥',
  18002: '钱包密码错误',
  18003: '根据私钥产生钱包地址出错',
  18004: 'keystore文件格式错误',
  18005: '无效助记词',
  18006: '根据私钥生成keystore文件时出错',
  18007: '钱包地址已经存在',
  18008: '钱包id对应的记录不存在，请确认钱包id的值',
  12002: '合约还在使用中，不可以删除',
  12005: '跨链合约abi检查错误',
};
